feaser/openblt/stm32_spl_to_hal/Target/Demo/ARMCM4_STM32F3_Nucleo_F303K8_IAR/Prog/startup_stm32f303.s
;/******************** (C) COPYRIGHT 2015 STMicroelectronics ********************
;* File Name          : startup_stm32f334x8.s
;* Author             : MCD Application Team
;* Version            : V1.2.2
;* Date               : 27-February-2015
;* Description        : STM32F334x8 devices vector table for EWARM toolchain.
;*                      This module performs:
;*                      - Set the initial SP
;*                      - Set the initial PC == _iar_program_start,
;*                      - Set the vector table entries with the exceptions ISR 
;*                        address.
;*                      - Branches to main in the C library (which eventually
;*                        calls main()).
;*                      After Reset the Cortex-M4 processor is in Thread mode,
;*                      priority is Privileged, and the Stack is set to Main.
;********************************************************************************
;* 
;* Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
;* You may not use this file except in compliance with the License.
;* You may obtain a copy of the License at:
;* 
;*        http://www.st.com/software_license_agreement_liberty_v2
;* 
;* Unless required by applicable law or agreed to in writing, software 
;* distributed under the License is distributed on an "AS IS" BASIS, 
;* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
;* See the License for the specific language governing permissions and
;* limitations under the License.
;* 
;*******************************************************************************
;
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; The vector table is normally located at address 0.
; When debugging in RAM, it can be located in RAM, aligned to at least 2^6.
; The name "__vector_table" has special meaning for C-SPY:
; it is where the SP start value is found, and the NVIC vector
; table register (VTOR) is initialized to this address if != 0.
;
; Cortex-M version
;

        MODULE  ?cstartup

        ;; Forward declaration of sections.
        SECTION CSTACK:DATA:NOROOT(3)

        SECTION .intvec:CODE:NOROOT(2)

        EXTERN  __iar_program_start
        EXTERN  SystemInit
        PUBLIC  __vector_table

        DATA
__vector_table
        DCD     sfe(CSTACK)
        DCD     Reset_Handler             ; Reset Handler

        DCD     NMI_Handler               ; NMI Handler
        DCD     HardFault_Handler         ; Hard Fault Handler
        DCD     MemManage_Handler         ; MPU Fault Handler
        DCD     BusFault_Handler          ; Bus Fault Handler
        DCD     UsageFault_Handler        ; Usage Fault Handler
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     SVC_Handler               ; SVCall Handler
        DCD     DebugMon_Handler          ; Debug Monitor Handler
        DCD     0                         ; Reserved
        DCD     PendSV_Handler            ; PendSV Handler
        DCD     SysTick_Handler           ; SysTick Handler

         ; External Interrupts
                DCD     WWDG_IRQHandler                   ; Window WatchDog                                        
                DCD     PVD_IRQHandler                    ; PVD through EXTI Line detection                        
                DCD     TAMPER_STAMP_IRQHandler           ; Tamper and TimeStamps through the EXTI line            
                DCD     RTC_WKUP_IRQHandler               ; RTC Wakeup through the EXTI line                       
                DCD     FLASH_IRQHandler                  ; FLASH                                           
                DCD     RCC_IRQHandler                    ; RCC                                             
                DCD     EXTI0_IRQHandler                  ; EXTI Line0                                             
                DCD     EXTI1_IRQHandler                  ; EXTI Line1                                             
                DCD     EXTI2_TS_IRQHandler               ; EXTI Line2 and Touch Sense                                             
                DCD     EXTI3_IRQHandler                  ; EXTI Line3                                             
                DCD     EXTI4_IRQHandler                  ; EXTI Line4                                             
                DCD     DMA1_Channel1_IRQHandler          ; DMA1 Channel 1                                   
                DCD     DMA1_Channel2_IRQHandler          ; DMA1 Channel 2                                   
                DCD     DMA1_Channel3_IRQHandler          ; DMA1 Channel 3                                   
                DCD     DMA1_Channel4_IRQHandler          ; DMA1 Channel 4                                   
                DCD     DMA1_Channel5_IRQHandler          ; DMA1 Channel 5                                   
                DCD     DMA1_Channel6_IRQHandler          ; DMA1 Channel 6                                   
                DCD     DMA1_Channel7_IRQHandler          ; DMA1 Channel 7                                   
                DCD     ADC1_2_IRQHandler                 ; ADC1 and ADC2                            
                DCD     CAN1_TX_IRQHandler                ; CAN1 TX                                               
                DCD     CAN1_RX0_IRQHandler               ; CAN1 RX0                                               
                DCD     CAN1_RX1_IRQHandler               ; CAN1 RX1                                               
                DCD     CAN1_SCE_IRQHandler               ; CAN1 SCE                                               
                DCD     EXTI9_5_IRQHandler                ; External Line[9:5]s                                    
                DCD     TIM1_BRK_TIM15_IRQHandler         ; TIM1 Break and TIM15                   
                DCD     TIM1_UP_TIM16_IRQHandler          ; TIM1 Update and TIM16                 
                DCD     TIM1_TRG_COM_TIM17_IRQHandler     ; TIM1 Trigger and Commutation and TIM17
                DCD     TIM1_CC_IRQHandler                ; TIM1 Capture Compare                                   
                DCD     TIM2_IRQHandler                   ; TIM2                                            
                DCD     TIM3_IRQHandler                   ; TIM3                                            
                DCD     0                                 ; Reserved                                            
                DCD     I2C1_EV_IRQHandler                ; I2C1 Event through EXTI Line 23                                            
                DCD     I2C1_ER_IRQHandler                ; I2C1 Error                                             
                DCD     0                                 ; Reserved                                             
                DCD     0                                 ; Reserved                                               
                DCD     SPI1_IRQHandler                   ; SPI1                                            
                DCD     0                                 ; Reserved                                            
                DCD     USART1_IRQHandler                 ; USART1 through EXTI Line 25                                         
                DCD     USART2_IRQHandler                 ; USART2 through EXTI Line 26                                         
                DCD     USART3_IRQHandler                 ; USART3 through EXTI Line 28                                         
                DCD     EXTI15_10_IRQHandler              ; External Line[15:10]s                                  
                DCD     RTC_Alarm_IRQHandler              ; RTC Alarm (A and B) through EXTI Line                  
                DCD     0                                 ; Reserved                        
                DCD     0                                 ; Reserved                  
                DCD     0                                 ; Reserved                
                DCD     0                                 ; Reserved
                DCD     0                                 ; Reserved                                   
                DCD     0                                 ; Reserved                                           
                DCD     0                                 ; Reserved                                            
                DCD     0                                 ; Reserved                                            
                DCD     0                                 ; Reserved                                            
                DCD     0                                 ; Reserved                                            
                DCD     0                                 ; Reserved                                           
                DCD     0                                 ; Reserved                                          
                DCD     TIM6_DAC1_IRQHandler              ; TIM6 and DAC1 underrun errors                   
                DCD     TIM7_DAC2_IRQHandler              ; TIM7 and DAC2 underrun errors                  
                DCD     0                                 ; Reserved                                   
                DCD     0                                 ; Reserved                                  
                DCD     0                                 ; Reserved                                   
                DCD     0                                 ; Reserved                                  
                DCD     0                                 ; Reserved                                   
                DCD     0                                 ; Reserved                                        
                DCD     0                                 ; Reserved                      
                DCD     0                                 ; Reserved                                               
                DCD     COMP2_IRQHandler                  ; COMP2                                               
                DCD     COMP4_6_IRQHandler                ; COMP4, COMP6                                              
                DCD     0                                 ; Reserved                                               
                DCD     HRTIM1_Master_IRQHandler          ; HRTIM1 master timer                                      
                DCD     HRTIM1_TIMA_IRQHandler            ; HRTIM1 timer A                                   
                DCD     HRTIM1_TIMB_IRQHandler            ; HRTIM1 timer B                                  
                DCD     HRTIM1_TIMC_IRQHandler            ; HRTIM1 timer C                                  
                DCD     HRTIM1_TIMD_IRQHandler            ; HRTIM1 timer D                                           
                DCD     HRTIM1_TIME_IRQHandler            ; HRTIM1 timer E                                            
                DCD     HRTIM1_FLT_IRQHandler             ; HRTIM1 fault                                             
                DCD     0                                 ; Reserved                       
                DCD     0                                 ; Reserved                    
                DCD     0                                 ; Reserved                         
                DCD     0                                 ; Reserved                                       
                DCD     0                                 ; Reserved                                        
                DCD     0                                 ; Reserved                                      
                DCD     0                                 ; Reserved 
                DCD     FPU_IRQHandler                    ; FPU
                DCD     0x55AA11EE                        ; Reserved for OpenBLT checksum

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; Default interrupt handlers.
;;
        THUMB
        PUBWEAK Reset_Handler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reset_Handler
        ; Initialize the stack pointer
        LDR	    R0, =sfe(CSTACK)
        MOV	    SP, R0

        LDR     R0, =SystemInit
        BLX     R0
        LDR     R0, =__iar_program_start
        BX      R0

        PUBWEAK NMI_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
NMI_Handler
        B NMI_Handler

        PUBWEAK HardFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
HardFault_Handler
        B HardFault_Handler

        PUBWEAK MemManage_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MemManage_Handler
        B MemManage_Handler

        PUBWEAK BusFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
BusFault_Handler
        B BusFault_Handler

        PUBWEAK UsageFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UsageFault_Handler
        B UsageFault_Handler

        PUBWEAK SVC_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SVC_Handler
        B SVC_Handler

        PUBWEAK DebugMon_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
DebugMon_Handler
        B DebugMon_Handler

        PUBWEAK PendSV_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
PendSV_Handler
        B PendSV_Handler

        PUBWEAK SysTick_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SysTick_Handler
        B SysTick_Handler

        PUBWEAK WWDG_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
WWDG_IRQHandler  
        B WWDG_IRQHandler

        PUBWEAK PVD_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PVD_IRQHandler  
        B PVD_IRQHandler

        PUBWEAK TAMPER_STAMP_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)    
TAMPER_STAMP_IRQHandler  
        B TAMPER_STAMP_IRQHandler

        PUBWEAK RTC_WKUP_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)  
RTC_WKUP_IRQHandler  
        B RTC_WKUP_IRQHandler

        PUBWEAK FLASH_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
FLASH_IRQHandler  
        B FLASH_IRQHandler

        PUBWEAK RCC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RCC_IRQHandler  
        B RCC_IRQHandler

        PUBWEAK EXTI0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
EXTI0_IRQHandler  
        B EXTI0_IRQHandler

        PUBWEAK EXTI1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
EXTI1_IRQHandler  
        B EXTI1_IRQHandler

        PUBWEAK EXTI2_TS_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
EXTI2_TS_IRQHandler  
        B EXTI2_TS_IRQHandler

        PUBWEAK EXTI3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
EXTI3_IRQHandler
        B EXTI3_IRQHandler

        PUBWEAK EXTI4_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)    
EXTI4_IRQHandler  
        B EXTI4_IRQHandler

        PUBWEAK DMA1_Channel1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)    
DMA1_Channel1_IRQHandler  
        B DMA1_Channel1_IRQHandler

        PUBWEAK DMA1_Channel2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)    
DMA1_Channel2_IRQHandler  
        B DMA1_Channel2_IRQHandler

        PUBWEAK DMA1_Channel3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)    
DMA1_Channel3_IRQHandler  
        B DMA1_Channel3_IRQHandler

        PUBWEAK DMA1_Channel4_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)    
DMA1_Channel4_IRQHandler  
        B DMA1_Channel4_IRQHandler

        PUBWEAK DMA1_Channel5_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)    
DMA1_Channel5_IRQHandler  
        B DMA1_Channel5_IRQHandler

        PUBWEAK DMA1_Channel6_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)    
DMA1_Channel6_IRQHandler  
        B DMA1_Channel6_IRQHandler

        PUBWEAK DMA1_Channel7_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)    
DMA1_Channel7_IRQHandler  
        B DMA1_Channel7_IRQHandler

        PUBWEAK ADC1_2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
ADC1_2_IRQHandler  
        B ADC1_2_IRQHandler

        PUBWEAK CAN1_TX_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1) 
CAN1_TX_IRQHandler  
        B CAN1_TX_IRQHandler

        PUBWEAK CAN1_RX0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)  
CAN1_RX0_IRQHandler  
        B CAN1_RX0_IRQHandler

        PUBWEAK CAN1_RX1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)  
CAN1_RX1_IRQHandler  
        B CAN1_RX1_IRQHandler

        PUBWEAK CAN1_SCE_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)  
CAN1_SCE_IRQHandler  
        B CAN1_SCE_IRQHandler

        PUBWEAK EXTI9_5_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1) 
EXTI9_5_IRQHandler  
        B EXTI9_5_IRQHandler

        PUBWEAK TIM1_BRK_TIM15_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)    
TIM1_BRK_TIM15_IRQHandler  
        B TIM1_BRK_TIM15_IRQHandler

        PUBWEAK TIM1_UP_TIM16_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)    
TIM1_UP_TIM16_IRQHandler  
        B TIM1_UP_TIM16_IRQHandler

        PUBWEAK TIM1_TRG_COM_TIM17_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)    
TIM1_TRG_COM_TIM17_IRQHandler  
        B TIM1_TRG_COM_TIM17_IRQHandler
        
        PUBWEAK TIM1_CC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)    
TIM1_CC_IRQHandler  
        B TIM1_CC_IRQHandler

        PUBWEAK TIM2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIM2_IRQHandler  
        B TIM2_IRQHandler

        PUBWEAK TIM3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIM3_IRQHandler  
        B TIM3_IRQHandler

        PUBWEAK I2C1_EV_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1) 
I2C1_EV_IRQHandler  
        B I2C1_EV_IRQHandler

        PUBWEAK I2C1_ER_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1) 
I2C1_ER_IRQHandler  
        B I2C1_ER_IRQHandler

        PUBWEAK SPI1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1) 
SPI1_IRQHandler  
        B SPI1_IRQHandler

        PUBWEAK USART1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
USART1_IRQHandler  
        B USART1_IRQHandler

        PUBWEAK USART2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
USART2_IRQHandler  
        B USART2_IRQHandler

        PUBWEAK USART3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
USART3_IRQHandler  
        B USART3_IRQHandler

        PUBWEAK EXTI15_10_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)   
EXTI15_10_IRQHandler  
        B EXTI15_10_IRQHandler

        PUBWEAK RTC_Alarm_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)   
RTC_Alarm_IRQHandler  
        B RTC_Alarm_IRQHandler

        PUBWEAK TIM6_DAC1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)    
TIM6_DAC1_IRQHandler  
        B TIM6_DAC1_IRQHandler

        PUBWEAK TIM7_DAC2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)   
TIM7_DAC2_IRQHandler  
        B TIM7_DAC2_IRQHandler

        PUBWEAK COMP2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)    
         
COMP2_IRQHandler  
        B COMP2_IRQHandler

        PUBWEAK COMP4_6_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)  
COMP4_6_IRQHandler  
        B COMP4_6_IRQHandler

        PUBWEAK HRTIM1_Master_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
HRTIM1_Master_IRQHandler  
        B HRTIM1_Master_IRQHandler

        PUBWEAK HRTIM1_TIMA_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
HRTIM1_TIMA_IRQHandler  
        B HRTIM1_TIMA_IRQHandler

        PUBWEAK HRTIM1_TIMB_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1) 
HRTIM1_TIMB_IRQHandler  
        B HRTIM1_TIMB_IRQHandler

        PUBWEAK HRTIM1_TIMC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1) 
HRTIM1_TIMC_IRQHandler  
        B HRTIM1_TIMC_IRQHandler

        PUBWEAK HRTIM1_TIMD_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)   
HRTIM1_TIMD_IRQHandler  
        B HRTIM1_TIMD_IRQHandler

        PUBWEAK HRTIM1_TIME_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1) 
HRTIM1_TIME_IRQHandler  
        B HRTIM1_TIME_IRQHandler

        PUBWEAK HRTIM1_FLT_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1) 
HRTIM1_FLT_IRQHandler  
        B HRTIM1_FLT_IRQHandler
        
        PUBWEAK FPU_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)                                  
FPU_IRQHandler  
        B FPU_IRQHandler

        END
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
